; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v2 ?v4)
             (pred_10 ?v12 ?v11)
             (pred_4 ?v2 ?v11)
             (pred_2 ?v6 ?v2 )
	     (pred_5 ?v2)
             (pred_8 ?v10)
             (pred_11 ?v12)
             (pred_1 ?v11)
             (pred_9 ?v2)
             (pred_7 ?v12)
             (pred_6 ?v2)
             (pred_12 ))



(:action op_1
:parameters (?v9 ?v5 ?v8 ?v7)
:precondition (and (pred_8 ?v9) (pred_8 ?v5) (pred_11 ?v8) (pred_1 ?v7)
          (pred_3 ?v9 ?v5) (pred_10 ?v8 ?v7)
                   (pred_4 ?v5 ?v7) (pred_5 ?v9) 
                   (pred_9 ?v5) (pred_7 ?v8))
:effect (and  (pred_6 ?v5) (not (pred_9 ?v5))))


(:action op_4
:parameters (?v9 ?v1)
:precondition (and (pred_8 ?v9) (pred_8 ?v1)
               (pred_5 ?v9) (pred_3 ?v9 ?v1) (pred_6 ?v1))
:effect (and (pred_5 ?v1) (not (pred_5 ?v9))))

(:action op_5
:parameters (?v9 ?v8)
:precondition (and (pred_8 ?v9) (pred_11 ?v8) 
                  (pred_5 ?v9) (pred_2 ?v8 ?v9) (pred_12 ))
:effect (and (pred_7 ?v8)
   (not (pred_2 ?v8 ?v9)) (not (pred_12 ))))


(:action op_3
:parameters (?v9 ?v3 ?v13)
:precondition (and (pred_8 ?v9) (pred_11 ?v3) (pred_11 ?v13)
                  (pred_5 ?v9) (pred_7 ?v13) (pred_2 ?v3 ?v9))
:effect (and (pred_7 ?v3) (pred_2 ?v13 ?v9)
        (not (pred_7 ?v13)) (not (pred_2 ?v3 ?v9))))

(:action op_2
:parameters (?v9 ?v8)
:precondition (and (pred_8 ?v9) (pred_11 ?v8) 
                  (pred_5 ?v9) (pred_7 ?v8))
:effect (and (pred_12 ) (pred_2 ?v8 ?v9) (not (pred_7 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_12 obj_01 obj_02 obj_22 obj_09 obj_03 obj_13 obj_16 obj_23 obj_15 obj_05 obj_04 obj_31 obj_21 obj_25 obj_32 obj_14 obj_11 obj_08 obj_30 obj_24 obj_19 obj_28 obj_20 obj_27
    obj_29 obj_06 obj_17
    obj_26 obj_18 obj_10 obj_07
    )

    (:init
       (pred_12)

       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_02)
       (pred_8 obj_22)
       (pred_8 obj_09)
       (pred_8 obj_03)
       (pred_8 obj_13)
       (pred_8 obj_16)
       (pred_8 obj_23)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_8 obj_04)
       (pred_8 obj_31)
       (pred_8 obj_21)
       (pred_8 obj_25)
       (pred_8 obj_32)
       (pred_8 obj_14)
       (pred_8 obj_11)
       (pred_8 obj_08)
       (pred_8 obj_30)
       (pred_8 obj_24)
       (pred_8 obj_19)
       (pred_8 obj_28)
       (pred_8 obj_20)
       (pred_8 obj_27)
       (pred_1 obj_29)
       (pred_1 obj_06)
       (pred_1 obj_17)
       (pred_11 obj_26)
       (pred_11 obj_18)
       (pred_11 obj_10)
       (pred_11 obj_07)

       (pred_3 obj_12 obj_03)
       (pred_3 obj_12 obj_01)
       (pred_3 obj_01 obj_13)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_12)
       (pred_3 obj_02 obj_16)
       (pred_3 obj_02 obj_22)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_22 obj_23)
       (pred_3 obj_22 obj_09)
       (pred_3 obj_22 obj_02)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_09 obj_22)
       (pred_3 obj_03 obj_05)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_03 obj_12)
       (pred_3 obj_13 obj_04)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_13 obj_01)
       (pred_3 obj_13 obj_03)
       (pred_3 obj_16 obj_31)
       (pred_3 obj_16 obj_23)
       (pred_3 obj_16 obj_02)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_23 obj_21)
       (pred_3 obj_23 obj_15)
       (pred_3 obj_23 obj_22)
       (pred_3 obj_23 obj_16)
       (pred_3 obj_15 obj_25)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_23)
       (pred_3 obj_05 obj_32)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_05 obj_03)
       (pred_3 obj_04 obj_14)
       (pred_3 obj_04 obj_31)
       (pred_3 obj_04 obj_13)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_31 obj_11)
       (pred_3 obj_31 obj_21)
       (pred_3 obj_31 obj_16)
       (pred_3 obj_31 obj_04)
       (pred_3 obj_21 obj_08)
       (pred_3 obj_21 obj_25)
       (pred_3 obj_21 obj_23)
       (pred_3 obj_21 obj_31)
       (pred_3 obj_25 obj_30)
       (pred_3 obj_25 obj_15)
       (pred_3 obj_25 obj_21)
       (pred_3 obj_32 obj_24)
       (pred_3 obj_32 obj_14)
       (pred_3 obj_32 obj_05)
       (pred_3 obj_14 obj_19)
       (pred_3 obj_14 obj_11)
       (pred_3 obj_14 obj_04)
       (pred_3 obj_14 obj_32)
       (pred_3 obj_11 obj_28)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_11 obj_31)
       (pred_3 obj_11 obj_14)
       (pred_3 obj_08 obj_20)
       (pred_3 obj_08 obj_30)
       (pred_3 obj_08 obj_21)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_30 obj_27)
       (pred_3 obj_30 obj_25)
       (pred_3 obj_30 obj_08)
       (pred_3 obj_24 obj_19)
       (pred_3 obj_24 obj_32)
       (pred_3 obj_19 obj_28)
       (pred_3 obj_19 obj_14)
       (pred_3 obj_19 obj_24)
       (pred_3 obj_28 obj_20)
       (pred_3 obj_28 obj_11)
       (pred_3 obj_28 obj_19)
       (pred_3 obj_20 obj_27)
       (pred_3 obj_20 obj_08)
       (pred_3 obj_20 obj_28)
       (pred_3 obj_27 obj_30)
       (pred_3 obj_27 obj_20)
       (pred_9 obj_19)
       (pred_9 obj_31)
       (pred_9 obj_15)
       (pred_9 obj_21)
       (pred_4  obj_19 obj_29)
       (pred_4  obj_31 obj_06)
       (pred_4  obj_15 obj_17)
       (pred_4  obj_21 obj_06)
       (pred_6 obj_12)
       (pred_6 obj_01)
       (pred_6 obj_02)
       (pred_6 obj_22)
       (pred_6 obj_09)
       (pred_6 obj_03)
       (pred_6 obj_13)
       (pred_6 obj_16)
       (pred_6 obj_23)
       (pred_6 obj_05)
       (pred_6 obj_04)
       (pred_6 obj_25)
       (pred_6 obj_32)
       (pred_6 obj_14)
       (pred_6 obj_11)
       (pred_6 obj_08)
       (pred_6 obj_30)
       (pred_6 obj_24)
       (pred_6 obj_28)
       (pred_6 obj_20)
       (pred_6 obj_27)

       (pred_10  obj_26 obj_29)
       (pred_10  obj_18 obj_06)
       (pred_10  obj_10 obj_17)
       (pred_10  obj_07 obj_06)
       (pred_2 obj_26 obj_14)
       (pred_2 obj_18 obj_16)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_07 obj_20)
       (pred_5 obj_01)
    )

    (:goal (and
       (pred_2 obj_26 obj_03)
       (pred_2 obj_10 obj_09)
       (pred_2 obj_07 obj_30)
    ))
(:constraints
  (always (not (pred_5 obj_08)))
)
)

; plan
1. (op_4 obj_01 obj_13)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_13)
   goals met: 0 of 3
2. (op_4 obj_13 obj_04)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_04)
   goals met: 0 of 3
3. (op_4 obj_04 obj_14)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_14)
   goals met: 0 of 3
4. (op_5 obj_14 obj_26)
   deleted: (pred_2 obj_26 obj_14) (pred_12)
   added: (pred_7 obj_26)
   goals met: 0 of 3
5. (op_4 obj_14 obj_04)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_04)
   goals met: 0 of 3
6. (op_4 obj_04 obj_13)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_13)
   goals met: 0 of 3
7. (op_4 obj_13 obj_03)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_03)
   goals met: 0 of 3
8. (op_2 obj_03 obj_26)
   deleted: (pred_7 obj_26)
   added: (pred_12) (pred_2 obj_26 obj_03)
   goals met: 1 of 3
9. (op_4 obj_03 obj_13)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_13)
   goals met: 1 of 3
10. (op_4 obj_13 obj_01)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_01)
   goals met: 1 of 3
11. (op_5 obj_01 obj_10)
   deleted: (pred_2 obj_10 obj_01) (pred_12)
   added: (pred_7 obj_10)
   goals met: 1 of 3
12. (op_4 obj_01 obj_13)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_13)
   goals met: 1 of 3
13. (op_4 obj_13 obj_04)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_04)
   goals met: 1 of 3
14. (op_4 obj_04 obj_14)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_14)
   goals met: 1 of 3
15. (op_4 obj_14 obj_11)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_11)
   goals met: 1 of 3
16. (op_4 obj_11 obj_28)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_28)
   goals met: 1 of 3
17. (op_4 obj_28 obj_20)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_20)
   goals met: 1 of 3
18. (op_3 obj_20 obj_07 obj_10)
   deleted: (pred_7 obj_10) (pred_2 obj_07 obj_20)
   added: (pred_7 obj_07) (pred_2 obj_10 obj_20)
   goals met: 1 of 3
19. (op_4 obj_20 obj_27)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_27)
   goals met: 1 of 3
20. (op_4 obj_27 obj_30)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_30)
   goals met: 1 of 3
21. (op_2 obj_30 obj_07)
   deleted: (pred_7 obj_07)
   added: (pred_12) (pred_2 obj_07 obj_30)
   goals met: 2 of 3
22. (op_4 obj_30 obj_27)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_27)
   goals met: 2 of 3
23. (op_4 obj_27 obj_20)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_20)
   goals met: 2 of 3
24. (op_5 obj_20 obj_10)
   deleted: (pred_2 obj_10 obj_20) (pred_12)
   added: (pred_7 obj_10)
   goals met: 2 of 3
25. (op_4 obj_20 obj_27)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_27)
   goals met: 2 of 3
26. (op_4 obj_27 obj_30)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_30)
   goals met: 2 of 3
27. (op_4 obj_30 obj_25)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_25)
   goals met: 2 of 3
28. (op_1 obj_25 obj_15 obj_10 obj_17)
   deleted: (pred_9 obj_15)
   added: (pred_6 obj_15)
   goals met: 2 of 3
29. (op_4 obj_25 obj_15)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_15)
   goals met: 2 of 3
30. (op_4 obj_15 obj_09)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_09)
   goals met: 2 of 3
31. (op_2 obj_09 obj_10)
   deleted: (pred_7 obj_10)
   added: (pred_12) (pred_2 obj_10 obj_09)
   goals met: 3 of 3
